Revit 2027 API
FabricationPart.RemovePartCustomData Method
 Remove custom data from the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool RemovePartCustomData(
	int customId
)
Public Function RemovePartCustomData (
	customId As Integer
) As Boolean
public:
bool RemovePartCustomData(
	int customId
)
member RemovePartCustomData :
        customId : int -> bool
Parameters
customId Int32
 The identifier of the custom data field to remove.
Return Value
Boolean
 Returns true if the type was found and removed. The type will not be removed if it is not an optional type.
Exceptions
Exception | Condition
ArgumentException |  The custom data does not exist on the part.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace